Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 12, 17)]     0                                            
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 12, 5)        0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12, 22)       0           in_window[0][0]                  
                                                                 repeat_vector[0][0]              
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 12, 128)      2944        concatenate[0][0]                
__________________________________________________________________________________________________
enc_lstm_lstm_0 (LSTM)          (None, 12, 128)      131584      time_distributed[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_0 (BatchNormaliz (None, 12, 128)      512         enc_lstm_lstm_0[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_1 (LSTM)          (None, 12, 128)      131584      enc_lstm_bnorm_0[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_1 (BatchNormaliz (None, 12, 128)      512         enc_lstm_lstm_1[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_2 (LSTM)          (None, 12, 64)       49408       enc_lstm_bnorm_1[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_2 (BatchNormaliz (None, 12, 64)       256         enc_lstm_lstm_2[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_3 (LSTM)          (None, 12, 32)       12416       enc_lstm_bnorm_2[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_3 (BatchNormaliz (None, 12, 32)       128         enc_lstm_lstm_3[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_4 (LSTM)          (None, 16)           3136        enc_lstm_bnorm_3[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_4 (BatchNormaliz (None, 16)           64          enc_lstm_lstm_4[0][0]            
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 12, 13)]     0                                            
__________________________________________________________________________________________________
repeat_vector_1 (RepeatVector)  (None, 12, 16)       0           enc_lstm_bnorm_4[0][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 12, 29)       0           in_horizon[0][0]                 
                                                                 repeat_vector_1[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_0 (LSTM)          (None, 12, 512)      1110016     concatenate_1[0][0]              
__________________________________________________________________________________________________
dec_lstm_bnorm_0 (BatchNormaliz (None, 12, 512)      2048        dec_lstm_lstm_0[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_1 (LSTM)          (None, 12, 512)      2099200     dec_lstm_bnorm_0[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_1 (BatchNormaliz (None, 12, 512)      2048        dec_lstm_lstm_1[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_2 (LSTM)          (None, 12, 256)      787456      dec_lstm_bnorm_1[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_2 (BatchNormaliz (None, 12, 256)      1024        dec_lstm_lstm_2[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_3 (LSTM)          (None, 12, 256)      525312      dec_lstm_bnorm_2[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_3 (BatchNormaliz (None, 12, 256)      1024        dec_lstm_lstm_3[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_4 (LSTM)          (None, 12, 128)      197120      dec_lstm_bnorm_3[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_4 (BatchNormaliz (None, 12, 128)      512         dec_lstm_lstm_4[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_5 (LSTM)          (None, 12, 128)      131584      dec_lstm_bnorm_4[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_5 (BatchNormaliz (None, 12, 128)      512         dec_lstm_lstm_5[0][0]            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 12, 4)        516         dec_lstm_bnorm_5[0][0]           
==================================================================================================
Total params: 5,190,916
Trainable params: 5,186,596
Non-trainable params: 4,320
__________________________________________________________________________________________________
