Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 12, 17)]     0                                            
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 12, 5)        0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12, 22)       0           in_window[0][0]                  
                                                                 repeat_vector[0][0]              
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 12, 64)       5696        concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 12, 64)       256         conv1d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 12, 64)       0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 12, 64)       16448       re_lu[0][0]                      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 12, 64)       1472        concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 12, 64)       256         conv1d_1[0][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 12, 64)       0           conv1d_2[0][0]                   
                                                                 batch_normalization_1[0][0]      
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 12, 64)       0           add[0][0]                        
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 12, 64)       16448       re_lu_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 12, 64)       256         conv1d_3[0][0]                   
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 12, 64)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 12, 64)       16448       re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 12, 64)       256         conv1d_4[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 12, 64)       0           re_lu_1[0][0]                    
                                                                 batch_normalization_3[0][0]      
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 12, 64)       0           add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 12, 64)       16448       re_lu_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 12, 64)       256         conv1d_5[0][0]                   
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 12, 64)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 12, 13)]     0                                            
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 12, 64)       16448       re_lu_4[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 12, 256)      3584        in_horizon[0][0]                 
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 12, 64)       256         conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 12, 256)      1024        dense[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 12, 64)       0           re_lu_3[0][0]                    
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 12, 256)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 12, 64)       0           add_2[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 12, 256)      65792       re_lu_6[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 12, 256)      16640       re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 12, 256)      1024        dense_1[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 12, 256)      0           dense_2[0][0]                    
                                                                 batch_normalization_7[0][0]      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 12, 256)      0           add_3[0][0]                      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 12, 4)        1028        re_lu_7[0][0]                    
==================================================================================================
Total params: 180,036
Trainable params: 178,244
Non-trainable params: 1,792
__________________________________________________________________________________________________
