Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 1, 17)]      0                                            
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 1, 13)]      0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 5)         0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 35)        0           in_window[0][0]                  
                                                                 in_horizon[0][0]                 
                                                                 reshape[0][0]                    
__________________________________________________________________________________________________
dense-3_dense_0 (Dense)         (None, 1, 256)       9216        concatenate[0][0]                
__________________________________________________________________________________________________
dense-3_bnorm_0 (BatchNormaliza (None, 1, 256)       1024        dense-3_dense_0[0][0]            
__________________________________________________________________________________________________
dense-3_dense_1 (Dense)         (None, 1, 256)       65792       dense-3_bnorm_0[0][0]            
__________________________________________________________________________________________________
dense-3_bnorm_1 (BatchNormaliza (None, 1, 256)       1024        dense-3_dense_1[0][0]            
__________________________________________________________________________________________________
dense-3_dense_2 (Dense)         (None, 1, 128)       32896       dense-3_bnorm_1[0][0]            
__________________________________________________________________________________________________
dense-3_bnorm_2 (BatchNormaliza (None, 1, 128)       512         dense-3_dense_2[0][0]            
__________________________________________________________________________________________________
dense-3_dense_3 (Dense)         (None, 1, 128)       16512       dense-3_bnorm_2[0][0]            
__________________________________________________________________________________________________
dense-3_bnorm_3 (BatchNormaliza (None, 1, 128)       512         dense-3_dense_3[0][0]            
__________________________________________________________________________________________________
dense-3_dense_4 (Dense)         (None, 1, 64)        8256        dense-3_bnorm_3[0][0]            
__________________________________________________________________________________________________
dense-3_bnorm_4 (BatchNormaliza (None, 1, 64)        256         dense-3_dense_4[0][0]            
__________________________________________________________________________________________________
dense-3_dense_5 (Dense)         (None, 1, 64)        4160        dense-3_bnorm_4[0][0]            
__________________________________________________________________________________________________
dense-3_bnorm_5 (BatchNormaliza (None, 1, 64)        256         dense-3_dense_5[0][0]            
__________________________________________________________________________________________________
output (Dense)                  (None, 1, 4)         260         dense-3_bnorm_5[0][0]            
==================================================================================================
Total params: 140,676
Trainable params: 138,884
Non-trainable params: 1,792
__________________________________________________________________________________________________
