Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 12, 17)]     0                                            
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 12, 5)        0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12, 22)       0           in_window[0][0]                  
                                                                 repeat_vector[0][0]              
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 12, 128)      2944        concatenate[0][0]                
__________________________________________________________________________________________________
enc_lstm_lstm_0 (LSTM)          (None, 12, 128)      131584      time_distributed[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_0 (BatchNormaliz (None, 12, 128)      512         enc_lstm_lstm_0[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_1 (LSTM)          (None, 12, 128)      131584      enc_lstm_bnorm_0[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_1 (BatchNormaliz (None, 12, 128)      512         enc_lstm_lstm_1[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_2 (LSTM)          (None, 12, 64)       49408       enc_lstm_bnorm_1[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_2 (BatchNormaliz (None, 12, 64)       256         enc_lstm_lstm_2[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_3 (LSTM)          (None, 12, 32)       12416       enc_lstm_bnorm_2[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_3 (BatchNormaliz (None, 12, 32)       128         enc_lstm_lstm_3[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_4 (LSTM)          (None, 16)           3136        enc_lstm_bnorm_3[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_4 (BatchNormaliz (None, 16)           64          enc_lstm_lstm_4[0][0]            
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 1, 13)]      0                                            
__________________________________________________________________________________________________
repeat_vector_1 (RepeatVector)  (None, 1, 16)        0           enc_lstm_bnorm_4[0][0]           
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1, 29)        0           in_horizon[0][0]                 
                                                                 repeat_vector_1[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_0 (LSTM)          (None, 1, 1024)      4317184     concatenate_1[0][0]              
__________________________________________________________________________________________________
dec_lstm_bnorm_0 (BatchNormaliz (None, 1, 1024)      4096        dec_lstm_lstm_0[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_1 (LSTM)          (None, 1, 1024)      8392704     dec_lstm_bnorm_0[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_1 (BatchNormaliz (None, 1, 1024)      4096        dec_lstm_lstm_1[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_2 (LSTM)          (None, 1, 512)       3147776     dec_lstm_bnorm_1[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_2 (BatchNormaliz (None, 1, 512)       2048        dec_lstm_lstm_2[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_3 (LSTM)          (None, 1, 512)       2099200     dec_lstm_bnorm_2[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_3 (BatchNormaliz (None, 1, 512)       2048        dec_lstm_lstm_3[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_4 (LSTM)          (None, 1, 512)       2099200     dec_lstm_bnorm_3[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_4 (BatchNormaliz (None, 1, 512)       2048        dec_lstm_lstm_4[0][0]            
__________________________________________________________________________________________________
dec_lstm_lstm_5 (LSTM)          (None, 1, 512)       2099200     dec_lstm_bnorm_4[0][0]           
__________________________________________________________________________________________________
dec_lstm_bnorm_5 (BatchNormaliz (None, 1, 512)       2048        dec_lstm_lstm_5[0][0]            
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 1, 4)         2052        dec_lstm_bnorm_5[0][0]           
==================================================================================================
Total params: 22,506,244
Trainable params: 22,497,316
Non-trainable params: 8,928
__________________________________________________________________________________________________
