Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 1, 17)]      0                                            
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 1, 13)]      0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 5)         0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1, 35)        0           in_window[0][0]                  
                                                                 in_horizon[0][0]                 
                                                                 reshape[0][0]                    
__________________________________________________________________________________________________
dense-0_dense_0 (Dense)         (None, 1, 512)       18432       concatenate[0][0]                
__________________________________________________________________________________________________
dense-0_bnorm_0 (BatchNormaliza (None, 1, 512)       2048        dense-0_dense_0[0][0]            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1, 512)       0           dense-0_bnorm_0[0][0]            
__________________________________________________________________________________________________
dense-0_dense_1 (Dense)         (None, 1, 512)       262656      dropout[0][0]                    
__________________________________________________________________________________________________
dense-0_bnorm_1 (BatchNormaliza (None, 1, 512)       2048        dense-0_dense_1[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1, 512)       0           dense-0_bnorm_1[0][0]            
__________________________________________________________________________________________________
dense-0_dense_2 (Dense)         (None, 1, 256)       131328      dropout_1[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_2 (BatchNormaliza (None, 1, 256)       1024        dense-0_dense_2[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 1, 256)       0           dense-0_bnorm_2[0][0]            
__________________________________________________________________________________________________
dense-0_dense_3 (Dense)         (None, 1, 256)       65792       dropout_2[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_3 (BatchNormaliza (None, 1, 256)       1024        dense-0_dense_3[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1, 256)       0           dense-0_bnorm_3[0][0]            
__________________________________________________________________________________________________
dense-0_dense_4 (Dense)         (None, 1, 128)       32896       dropout_3[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_4 (BatchNormaliza (None, 1, 128)       512         dense-0_dense_4[0][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 1, 128)       0           dense-0_bnorm_4[0][0]            
__________________________________________________________________________________________________
dense-0_dense_5 (Dense)         (None, 1, 128)       16512       dropout_4[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_5 (BatchNormaliza (None, 1, 128)       512         dense-0_dense_5[0][0]            
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 1, 128)       0           dense-0_bnorm_5[0][0]            
__________________________________________________________________________________________________
dense-0_dense_6 (Dense)         (None, 1, 64)        8256        dropout_5[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_6 (BatchNormaliza (None, 1, 64)        256         dense-0_dense_6[0][0]            
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 1, 64)        0           dense-0_bnorm_6[0][0]            
__________________________________________________________________________________________________
dense-0_dense_7 (Dense)         (None, 1, 64)        4160        dropout_6[0][0]                  
__________________________________________________________________________________________________
dense-0_bnorm_7 (BatchNormaliza (None, 1, 64)        256         dense-0_dense_7[0][0]            
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 1, 64)        0           dense-0_bnorm_7[0][0]            
__________________________________________________________________________________________________
output (Dense)                  (None, 1, 4)         260         dropout_7[0][0]                  
==================================================================================================
Total params: 547,972
Trainable params: 544,132
Non-trainable params: 3,840
__________________________________________________________________________________________________
