Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_static (InputLayer)          [(None, 5)]          0                                            
__________________________________________________________________________________________________
in_window (InputLayer)          [(None, 12, 17)]     0                                            
__________________________________________________________________________________________________
repeat_vector (RepeatVector)    (None, 12, 5)        0           in_static[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 12, 22)       0           in_window[0][0]                  
                                                                 repeat_vector[0][0]              
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, 12, 128)      2944        concatenate[0][0]                
__________________________________________________________________________________________________
enc_lstm_lstm_0 (LSTM)          (None, 12, 128)      131584      time_distributed[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_0 (BatchNormaliz (None, 12, 128)      512         enc_lstm_lstm_0[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_1 (LSTM)          (None, 12, 96)       86400       enc_lstm_bnorm_0[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_1 (BatchNormaliz (None, 12, 96)       384         enc_lstm_lstm_1[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_2 (LSTM)          (None, 12, 64)       41216       enc_lstm_bnorm_1[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_2 (BatchNormaliz (None, 12, 64)       256         enc_lstm_lstm_2[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_3 (LSTM)          (None, 12, 32)       12416       enc_lstm_bnorm_2[0][0]           
__________________________________________________________________________________________________
enc_lstm_bnorm_3 (BatchNormaliz (None, 12, 32)       128         enc_lstm_lstm_3[0][0]            
__________________________________________________________________________________________________
enc_lstm_lstm_4 (LSTM)          (None, 16)           3136        enc_lstm_bnorm_3[0][0]           
__________________________________________________________________________________________________
in_horizon (InputLayer)         [(None, 1, 13)]      0                                            
__________________________________________________________________________________________________
enc_lstm_bnorm_4 (BatchNormaliz (None, 16)           64          enc_lstm_lstm_4[0][0]            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 13)           0           in_horizon[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 29)           0           enc_lstm_bnorm_4[0][0]           
                                                                 reshape[0][0]                    
__________________________________________________________________________________________________
dec_dense_dense_0 (Dense)       (None, 512)          15360       concatenate_1[0][0]              
__________________________________________________________________________________________________
dec_dense_bnorm_0 (BatchNormali (None, 512)          2048        dec_dense_dense_0[0][0]          
__________________________________________________________________________________________________
dropout (Dropout)               (None, 512)          0           dec_dense_bnorm_0[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_1 (Dense)       (None, 512)          262656      dropout[0][0]                    
__________________________________________________________________________________________________
dec_dense_bnorm_1 (BatchNormali (None, 512)          2048        dec_dense_dense_1[0][0]          
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           dec_dense_bnorm_1[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_2 (Dense)       (None, 256)          131328      dropout_1[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_2 (BatchNormali (None, 256)          1024        dec_dense_dense_2[0][0]          
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256)          0           dec_dense_bnorm_2[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_3 (Dense)       (None, 256)          65792       dropout_2[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_3 (BatchNormali (None, 256)          1024        dec_dense_dense_3[0][0]          
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 256)          0           dec_dense_bnorm_3[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_4 (Dense)       (None, 128)          32896       dropout_3[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_4 (BatchNormali (None, 128)          512         dec_dense_dense_4[0][0]          
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 128)          0           dec_dense_bnorm_4[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_5 (Dense)       (None, 128)          16512       dropout_4[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_5 (BatchNormali (None, 128)          512         dec_dense_dense_5[0][0]          
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 128)          0           dec_dense_bnorm_5[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_6 (Dense)       (None, 96)           12384       dropout_5[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_6 (BatchNormali (None, 96)           384         dec_dense_dense_6[0][0]          
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 96)           0           dec_dense_bnorm_6[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_7 (Dense)       (None, 96)           9312        dropout_6[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_7 (BatchNormali (None, 96)           384         dec_dense_dense_7[0][0]          
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 96)           0           dec_dense_bnorm_7[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_8 (Dense)       (None, 64)           6208        dropout_7[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_8 (BatchNormali (None, 64)           256         dec_dense_dense_8[0][0]          
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 64)           0           dec_dense_bnorm_8[0][0]          
__________________________________________________________________________________________________
dec_dense_dense_9 (Dense)       (None, 64)           4160        dropout_8[0][0]                  
__________________________________________________________________________________________________
dec_dense_bnorm_9 (BatchNormali (None, 64)           256         dec_dense_dense_9[0][0]          
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 64)           0           dec_dense_bnorm_9[0][0]          
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 4)            260         dropout_9[0][0]                  
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 4)         0           dense_1[0][0]                    
==================================================================================================
Total params: 844,356
Trainable params: 839,460
Non-trainable params: 4,896
__________________________________________________________________________________________________
